#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+OPTIONS: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+TITLE: SiScLab_Git_Notes
#+DATE: <2018-11-14 Wed>
#+AUTHOR: Johannes Wasmer
#+EMAIL: johannes@joe-9470m
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 25.2.2 (Org mode 9.1.13)

#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:
#+LATEX_HEADER:
#+LATEX_HEADER_EXTRA:
#+DESCRIPTION:
#+KEYWORDS:
#+SUBTITLE:
#+LATEX_COMPILER: pdflatex
#+DATE: \today

- top-level items: newest is first
** DONE Clone repo and switch to remote branch =develop=
   CLOSED: [2018-11-14 Wed 16:01]
#+BEGIN_SRC shell
# cd to directory where local repo should reside
cd /home/johannes/Desktop/Studium/Kurse_RWTH/SiScLab/18W/repos/masci-tools
# clone
git clone https://github.com/JuDFTteam/masci-tools.git
cd masci-tools/
# switch to remote branch develop
git fetch
git checkout develop
# check that we're now on the correct remote branch:
git branch -av
#+END_SRC

#+RESULTS:
| *                      | develop | 42b6d83       | added       | bonddos.hdf | plot | tool |     0 | could | be    | moved | to  | new    | folder |
| master                 | 6afe02d | Add           | pytest-cov  | dependency  |      |      |       |       |       |       |     |        |        |
| remotes/origin/HEAD    | ->      | origin/master |             |             |      |      |       |       |       |       |     |        |        |
| remotes/origin/develop | 42b6d83 | added         | bonddos.hdf | plot        | tool |    0 | could | be    | moved | to    | new | folder |        |
| remotes/origin/master  | 6afe02d | Add           | pytest-cov  | dependency  |      |      |       |       |       |       |     |        |        |
